# # 2) for ციკლით მომხარებელს შემოატანინეთ 5 ელემენტი სიაში და დაბეჭდეთ სია
# # I.for ციკლით შემოვიტანოთ 5 ელემენტი
# Element = []
# for i in range(5):
# # II.ეს გავაკეთებინოთ მომხმარებელს  და შევიტანოთ სიაში 
#     Element.append(int(input("enter eny symbol: " )))
# # III.გამოვიტანოთ ტერმინალში
# print(Element)

# # 3) შექმენით ხილების სია, სადაც გექნებათ მინიმუმ 3 ელემენტი. მომხარებელს შემოატანინეთ თავისი საყვარელი ხილი, თუ სიის ბოლო ელემენტის ინდექსი არის ლუწი ჩაამატეთ შემოტანილი ხილი სიაში, სხვა შემთხვევაში არ ჩაამატოთ 
# # I.შემოგვაქცს სია 
# fruit = ["apple","Banana","Cherry","lemon","lime"]
# # II.ვეკითხებით მომხმარებელს ხილს რომელიც უყვარს და შეგვაქ ის სიაში
# fruit.append(input("tell me your favorite fruit: "))
# # III.გამოგვაქვს ტერმინალში
# print(fruit)

# 4) შექმენით სია შემდგარი სახელებისგან. მომხარებელს შემოატანინეთ მისი სახელი, თუ მისი სახელი იქნება 5 სიმბოლოს ტოლი ან მეტი. ჩაამატეთ სიაში, სხვა შემთხვევაში დაუბეჭდეთ "Name is too short"
# I.გავაკეთოთ სია სახელებით
names = ["saba","nika","luka","giorgi"]
# II.მომხმარებელს სემოვატანინოთ მისი სახელი რათა შევიტანოთ სიაში
name = (input("tell me your name: " ))
# III.თუ მისი სახელი იქნება 5 სიმბოლოზე ნაკლები ვუთხრათ "Name is too short" სხვა შემთხვევაში შევიტანოთ
if len(name)< 5:
    print("Name is too short")
else:
    names.append(name)
    print(names)
# 5) შექმენით სია შემდგარი 10 ელემენტისგან. დაპრინტეთ ის და მომხარებელს შემოატანინეთ რიცხვი 1-დან 10-ჩათვლით. შემდეგ წაშალეთ სიის ის ელემენტი რომელი რიცხვიც გადმოგეცათ და დაპრინტეთ განახლებული სია
