
# 5) შექმენთ ფუნქცია, რომელიც არგუმენტად იღებს სიმბოლოების სიას. დაასორტირეთ ეს სია ანბანის მიხედვით, 
# გადააქციეთ string-ად და დააბრუნეთ

symbols = ["d","c","b","a"]
symbols.sort()
print(str(symbols))

# 6) შექმენით ფუნქცია, რომელიც არგუმენტად იღებს რიცხვების სიას და აბრუნებს მას კლებადობის მიხედვით დასორტირებულს

numbers = [1,2,3,4,5,6,7]
numbers.sort()
print(numbers[::-1])

# 4) შექმენით ფუნქცია, რომელიც არგუმენტად მიიღებს string-ს. ამ ფუნქციამ უნდა გაიგოს გადმოცემულ string-ში 
# თითოეული სიმბოლოს რაოდენობა და ჩაამატოს ახალ სიაში(ერთი სიმბოლის რაოდენობა მხოლოდ ერთხელ უნდა ჩაამატოთ. 
# მგალითად თუ string-ში 5 "a" გვხვდება, რიცხვი 5 მასივში მხოლოდ ერთხელ უნდა ჩავამატოთ, მაგრამ სხვა სიმბოლოც თუ
#  გვხვდება იგივე რაოდენობით, მას ვამატებთ ჩვეულებრივ). საბოლოდ დაასორტირეთ მიღებული სია ზრდადობით და
#  დააბრუნეთ
def count_of_symbols(string1):
    
    counted_symbols = []
    for i in string1:
        string1.count(i)
        counted_symbols.append(i)
    return counted_symbols
print(count_of_symbols("saba"))